const WYRMBLADE = {
    "name": "WYRMBLADE",
    "faction": "GENESTEALER CULTS",
    "abilities": [
        {
            "name": "Preternatural Assassin",
            "description": [
                "This operative cannot be equipped with equipment.",
                "",
                "This operative has a 4+ invulnerable save.",
                "",
                "Each time a shooting attack is made against this operative, in the Roll Defence Dice step of that shooting attack, before rolling your defence dice, if it is in Cover, you can do one of the following:",
                "• Retain one additional dice as a successful normal save as a result of Cover.",
                "• Retain one dice as a successful critical save instead of a normal save as a result of Cover.",
            ]
        },
        {
            "name": "Cult Ambush",
            "description": [
                "During the first Turning Point, when this operative is activated, you can change its order.",
                "",
                "The first time this operative performs either a Fight or Shoot action in each of its activations, if its order was changed from Conceal to Engage during that activation, or it wasn't visible to every enemy operative at the start of that activation, in the Roll Attack Dice step of that combat or shooting attack, you can re-roll any or all of your attack dice results of one result (e.g. results of 2)."
            ]
        }
    ],
    "strategicPloys": [
        {
            "name": "METICULOUS PLAN",
            "cost": 1,
            "description": [
                "Until the end of the Turning Point, each time a friendly NEOPHYTE operative is activated, if it has a Conceal order, it can perform a mission action or the Pick Up action for one less action point (to a minimum of 0AP).",
                "You can only use this Strategic Ploy once."
            ]
        },
        {
            "name": "ONE WITH THE SHADOWS",
            "cost": 1,
            "description": [
                "Until the end of the Turning Point, when determining Line of Sight from an enemy operative to a friendly WYRMBLADE operative, if that friendly WYRMBLADE operative has a Conceal order, Light terrain is Obscuring."
            ]
        },
        {
            "name": "WRITHING INGRESS",
            "cost": 1,
            "description": [
                "Place one of your Ingress tokens within ((1)) of a terrain feature no more than ((1)) thick. Until the end of the battle, friendly WYRMBLADE operatives can move through that terrain feature as if it were not there, so long as they do so within ((1)) of that token.",
                "You can only use this Strategic Ploy once."
            ]
        },
        {
            "name": "CROSSFIRE",
            "cost": 1,
            "description": [
                "Until the end of the Turning Point:",
                "• Each time after a friendly WYRMBLADE operative makes a shooting attack, if the target has not been incapacitated and does not have a Crossfire token, the target gains a Crossfire token until the end of the Turning Point.",
                "• Each time a friendly WYRMBLADE operative makes a shooting attack, if the target has a Crossfire token, in the Roll Attack Dice step of that shooting attack, before rolling your attack dice, you can retain one as a successful normal hit without rolling it."
            ]
        }
    ],
    "tacticalPloys": [
        {
            "name": "SLINK INTO DARKNESS",
            "cost": 1,
            "description": [
                "Use this Tactical Ploy at the end of a friendly WYRMBLADE operative's activation. If that operative has an Engage order, change it to a Conceal order.",
                "You can only use this Tactical Ploy for each friendly operative once."
            ]
        },
        {
            "name": "COILED SERPENT",
            "cost": 1,
            "description": [
                "Use this Tactical Ploy when a friendly WYRMBLADE operative is activated and its order is changed from Conceal to Engage. The first time that operative performs either a Fight or Shoot action during that activation, in the Roll Attack Dice step of that combat or shooting attack, you can retain one of your successful normal hits as a critical hit instead."
            ]
        },
        {
            "name": "UNQUESTIONING LOYALTY",
            "cost": 1,
            "description": [
                "Use this Tactical Ploy when a friendly WYRMBLADE LEADER or CULT AGENT operative is selected as the target for combat. Select one other friendly LOCUS or NEOPHYTE operative (excluding a LEADER operative) within ((3)) of that friendly operative to intervene.",
                "• If that intervening friendly operative is not within Engagement Range of an enemy operative, you can interrupt that combat to perform a free Charge action with it, but it must finish that move within Engagement Range of the enemy operative fighting in that combat.",
                "• If that intervening friendly operative is within Engagement Range of that enemy operative, it becomes the target for that combat."
            ]
        },
        {
            "name": "HIDING",
            "cost": 1,
            "description": [
                "Use this Tactical Ploy in the Set Up Operatives step of the mission sequence, when you would set up operatives. Select up to two friendly NEOPHYTE operatives to be set up hiding instead. In the Firefight phase of the first Turning Point:",
                "• Friendly operatives hiding have a Group Activation characteristic of 1, are considered to be within the killzone for activation purposes and can be activated as normal.",
                "• When a friendly operative hiding is activated for the first time, set it up with an order of your choice anywhere in the killzone within ((6)) of your drop zone and more than ((3)) from enemy operatives. That operative is treated as having performed a Normal Move action (subtract action points accordingly), then continue its activation as normal.",
                "• Any hiding operatives not activated by the end of the first Turning Point are incapacitated.",
                "You can only use this Tactical Ploy once."
            ]
        }
    ],
    "fireTeams": [
        {
            "name": "Wyrmblade",
            "operatives": [
                {
                    "name": "Neophyte Leader",
                    "mandatory": true,
                    "limitNum": 1,
                    "stats": [6,2,1,3,5,8],
                    "abilities": [
                        {
                            "name": "Cult Ambush"
                        },
                        {
                            "name": "Shadow Vector",
                            "description": [
                                "Once per Turning Point, you can use either the Slink Into Darkness or Coiled Serpent Tactical Ploy without spending any Command points if a friendly NEOPHYTE operative Visible to this operative is the friendly WYRMBLADE operative for that ploy."
                            ]
                        }
                    ],
                    "weapons": [
                        {
                            "type": "((R))",
                            "name": "Autogun",
                            "profiles": [
                                {
                                    "attacks": 4,
                                    "skill": 3,
                                    "damageNorm": 2,
                                    "damageCrit": 3
                                }
                            ]
                        },
                        {
                            "type": "((R))",
                            "name": "Bolt pistol",
                            "profiles": [
                                {
                                    "attacks": 4,
                                    "skill": 3,
                                    "damageNorm": 3,
                                    "damageCrit": 4,
                                    "range": 6
                                }
                            ]
                        },
                        {
                            "type": "((R))",
                            "name": "Master-crafted autopistol",
                            "profiles": [
                                {
                                    "attacks": 4,
                                    "skill": 3,
                                    "damageNorm": 2,
                                    "damageCrit": 3,
                                    "range": 6,
                                    "specialRules": ["Balanced", "Lethal 5+"]
                                }
                            ]
                        },
                        {
                            "type": "((R))",
                            "name": "Shotgun",
                            "profiles": [
                                {
                                    "attacks": 4,
                                    "skill": 2,
                                    "damageNorm": 3,
                                    "damageCrit": 3,
                                    "range": 6
                                }
                            ]
                        },
                        {
                            "type": "((R))",
                            "name": "Web pistol",
                            "profiles": [
                                {
                                    "attacks": 4,
                                    "skill": 2,
                                    "damageNorm": 2,
                                    "damageCrit": 2,
                                    "range": 6,
                                    "criticalEffects": ["Stun"]
                                }
                            ]
                        },
                        {
                            "type": "((M))",
                            "name": "Chainsword",
                            "profiles": [
                                {
                                    "attacks": 4,
                                    "skill": 3,
                                    "damageNorm": 4,
                                    "damageCrit": 5,
                                    "specialRules": ["Ceaseless"]
                                }
                            ]
                        },
                        {
                            "type": "((M))",
                            "name": "Gun butt",
                            "profiles": [
                                {
                                    "attacks": 3,
                                    "skill": 4,
                                    "damageNorm": 2,
                                    "damageCrit": 3
                                }
                            ]
                        },
                        {
                            "type": "((M))",
                            "name": "Power maul",
                            "profiles": [
                                {
                                    "attacks": 4,
                                    "skill": 3,
                                    "damageNorm": 4,
                                    "damageCrit": 5,
                                    "criticalEffects": ["Stun"]
                                }
                            ]
                        },
                        {
                            "type": "((M))",
                            "name": "Power pick",
                            "profiles": [
                                {
                                    "attacks": 4,
                                    "skill": 3,
                                    "damageNorm": 4,
                                    "damageCrit": 5,
                                    "criticalEffects": ["Rending"]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Kelermorph",
                    "mandatory": false,
                    "limitNum": 1,
                    "stats": [6,3,1,3,4,9],
                    "abilities": [
                        {
                            "name": "Cult Ambush"
                        },
                        {
                            "name": "Preternatural Assassin"
                        },
                        {
                            "name": "Heroic Inspiration",
                            "description": [
                                "If this operative incapacitates an enemy operative, until the end of the Turning Point, it is a Heroic Inspiration. Each time a friendly WYRMBLADE NEOPHYTE operative fights in combat or makes a shooting attack, if this operative is a Heroic Inspiration and is Visible to and within ((3)) the friendly operative, in the Roll Attack Dice step of that combat or shooting attack, you can retain one of your attack dice results of 5+ that is a successful normal hit as a critical hit instead."
                            ]
                        },
                        {
                            "name": "Expert Gunslinger",
                            "description": [
                                "This operative can perform two Shoot actions during each of its activations."
                            ]
                        }
                    ],
                    "actions": [
                        {
                            "name": "Hypersense",
                            "cost": 1,
                            "description": [
                                "The next time this operative performs a Shoot action during this activation, for that shooting attack, the short range profile of its liberator autostubs gains the Indirect and No Cover special rules but loses the P1 and Rending critical hit rules."
                            ],
                        }
                    ],
                    "weapons": [
                        {
                            "type": "((R))",
                            "name": "Liberator autostubs",
                            "profiles": [
                                {
                                    "name": "Long range",
                                    "attacks": 4,
                                    "skill": 4,
                                    "damageNorm": 3,
                                    "damageCrit": 4,
                                    "criticalEffects": ["P1","Rending"]
                                },
                                {
                                    "name": "Short range",
                                    "attacks": 5,
                                    "skill": 2,
                                    "damageNorm": 3,
                                    "damageCrit": 4,
                                    "range": 6,
                                    "criticalEffects": ["P1","Rending"]
                                },
                                {
                                    "name": "(1AP) Hypersense",
                                    "attacks": 5,
                                    "skill": 2,
                                    "damageNorm": 3,
                                    "damageCrit": 4,
                                    "range": 6,
                                    "criticalEffects": ["Indirect","No Cover"]
                                }
                            ]
                        },
                        {
                            "type": "((M))",
                            "name": "Kelermorph knife",
                            "profiles": [
                                {
                                    "attacks": 3,
                                    "skill": 3,
                                    "damageNorm": 3,
                                    "damageCrit": 4,
                                    "criticalEffects": ["Rending"]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Neophyte Brood-Adepts",
                    "mandatory": false,
                    "limitNum": 0,
                    "stats": [6,2,2,3,5,7],
                    "abilities": [
                        {
                            "name": "Cult Ambush"
                        }
                    ],
                    "weapons": [
                        {
                            "type": "((R))",
                            "name": "Autogun",
                            "profiles": [
                                {
                                    "attacks": 4,
                                    "skill": 4,
                                    "damageNorm": 2,
                                    "damageCrit": 3
                                }
                            ]
                        },
                        {
                            "type": "((R))",
                            "name": "Shotgun",
                            "profiles": [
                                {
                                    "attacks": 4,
                                    "skill": 3,
                                    "damageNorm": 3,
                                    "damageCrit": 3,
                                    "range": 6
                                }
                            ]
                        },
                        {
                            "type": "((M))",
                            "name": "Gun butt",
                            "profiles": [
                                {
                                    "attacks": 3,
                                    "skill": 4,
                                    "damageNorm": 2,
                                    "damageCrit": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Neophyte Gunner",
                    "mandatory": false,
                    "limitNum": 3,
                    "stats": [6,2,1,3,5,7],
                    "abilities": [
                        {
                            "name": "Cult Ambush"
                        }
                    ],
                    "weapons": [
                        {
                            "type": "((R))",
                            "name": "Flamer",
                            "profiles": [
                                {
                                    "attacks": 5,
                                    "skill": 2,
                                    "damageNorm": 2,
                                    "damageCrit": 2,
                                    "range": 6,
                                    "specialRules": ["Torrent ((2))"]
                                }
                            ]
                        },
                        {
                            "type": "((R))",
                            "name": "Grenade launcher",
                            "profiles": [
                                {
                                    "name": "Frag",
                                    "attacks": 4,
                                    "skill": 4,
                                    "damageNorm": 2,
                                    "damageCrit": 4,
                                    "specialRules": ["Blast ((2))"]
                                },
                                {
                                    "name": "Krak",
                                    "attacks": 4,
                                    "skill": 4,
                                    "damageNorm": 4,
                                    "damageCrit": 5,
                                    "specialRules": ["AP1"]
                                }
                            ]
                        },
                        {
                            "type": "((R))",
                            "name": "Webber",
                            "profiles": [
                                {
                                    "attacks": 5,
                                    "skill": 3,
                                    "damageNorm": 2,
                                    "damageCrit": 2,
                                    "range": 6,
                                    "specialRules": ["Lethal 5+"]
                                }
                            ]
                        },
                        {
                            "type": "((M))",
                            "name": "Gun butt",
                            "profiles": [
                                {
                                    "attacks": 3,
                                    "skill": 4,
                                    "damageNorm": 2,
                                    "damageCrit": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Neophyte Heavy Gunner",
                    "mandatory": false,
                    "limitNum": 3,
                    "stats": [6,2,1,3,5,7],
                    "abilities": [
                        {
                            "name": "Cult Ambush"
                        },
                        {
                            "name": "Suspensor System",
                            "description": [
                                "The Heavy special rule of ranged weapons the operative is equipped with is treated differently. Instead, an operative cannot move more than 3((2)) in the same activation in which it performs a Shoot action with any of those ranged weapons."
                            ]
                        }
                    ],
                    "weapons": [
                        {
                            "type": "((R))",
                            "name": "Heavy stubber",
                            "profiles": [
                                {
                                    "attacks": 5,
                                    "skill": 4,
                                    "damageNorm": 3,
                                    "damageCrit": 4,
                                    "specialRules": ["Ceaseless", "Fusillade", "Heavy"]
                                }
                            ]
                        },
                        {
                            "type": "((R))",
                            "name": "Mining laser",
                            "profiles": [
                                {
                                    "attacks": 5,
                                    "skill": 4,
                                    "damageNorm": 5,
                                    "damageCrit": 6,
                                    "specialRules": ["AP1","Heavy"]
                                }
                            ]
                        },
                        {
                            "type": "((R))",
                            "name": "Seismic cannon",
                            "profiles": [
                                {
                                    "name": "Long-wave",
                                    "attacks": 6,
                                    "skill": 4,
                                    "damageNorm": 2,
                                    "damageCrit": 2,
                                    "specialRules": ["Blast ((1))", "Heavy"],
                                    "criticalEffects": ["Stun"]
                                },
                                {
                                    "name": "Short-wave",
                                    "attacks": 4,
                                    "skill": 3,
                                    "damageNorm": 4,
                                    "damageCrit": 4,
                                    "range": 6,
                                    "specialRules": ["Heavy"],
                                    "criticalEffects": ["P1", "Stun"]
                                }
                            ]
                        },
                        {
                            "type": "((M))",
                            "name": "Gun butt",
                            "profiles": [
                                {
                                    "attacks": 3,
                                    "skill": 4,
                                    "damageNorm": 2,
                                    "damageCrit": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Neophyte Icon Bearer",
                    "mandatory": false,
                    "limitNum": 1,
                    "stats": [6,2,1,3,5,7],
                    "abilities": [
                        {
                            "name": "Cult Ambush"
                        },
                        {
                            "name": "Icon Bearer",
                            "description": [
                                "When determining control of an objective marker, treat this operative's APL characteristic as being 1 higher. Note that this is not a modifier. In narrative play, this is cumulative with the Focused Battle Honour."
                            ]
                        }
                    ],
                    "actions": [
                        {
                            "name": "Signal the Strike",
                            "cost": 1,
                            "description": [
                                "Until the end of the Turning Point, for the purposes of the Cult Ambush ability, if this operative is Visible to and within ((3)) of the friendly operative performing the Fight or Shoot action, you can re-roll any or all of your attack dice instead (rather than attack dice results of one result). This operative cannot perform this action while within Engagement Range of an enemy operative."
                            ]
                        }
                    ],
                    "weapons": [
                        {
                            "type": "((R))",
                            "name": "Autogun",
                            "profiles": [
                                {
                                    "attacks": 4,
                                    "skill": 4,
                                    "damageNorm": 2,
                                    "damageCrit": 3
                                }
                            ]
                        },
                        {
                            "type": "((R))",
                            "name": "Shotgun",
                            "profiles": [
                                {
                                    "attacks": 4,
                                    "skill": 3,
                                    "damageNorm": 3,
                                    "damageCrit": 3,
                                    "range": 6
                                }
                            ]
                        },
                        {
                            "type": "((M))",
                            "name": "Gun butt",
                            "profiles": [
                                {
                                    "attacks": 3,
                                    "skill": 4,
                                    "damageNorm": 2,
                                    "damageCrit": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Sanctus Sniper",
                    "mandatory": false,
                    "limitNum": 1,
                    "stats": [6,3,1,3,4,9],
                    "abilities": [
                        {
                            "name": "Cult Ambush"
                        },
                        {
                            "name": "Preternatural Assassin"
                        }
                    ],
                    "actions": [
                        {
                            "name": "Target Vulnerability",
                            "cost": 1,
                            "description": [
                                "Until the end of the activation, the Sanctus sniper rifle this operative is equipped with gains the Lethal 5+ special rule."
                            ]
                        },
                        {
                            "name": "Familiar's Soulsight",
                            "cost": 1,
                            "description": [
                                "Select one enemy operative. Until end of the Turning Point, each time this operative makes a shooting attack against that enemy operative:",
                                "• The Sanctus sniper rifle this operative is equipped with gains the No Cover special rule for that shooting attack.",
                                "• That enemy operative cannot be Obscured for that shooting attack.",
                                "• Areas of smoke cannot prevent that enemy operative from being Visible for that shooting attack.",
                            ]
                        }
                    ],
                    "weapons": [
                        {
                            "type": "((R))",
                            "name": "Sanctus sniper rifle",
                            "profiles": [
                                {
                                    "attacks": 4,
                                    "skill": 2,
                                    "damageNorm": 3,
                                    "damageCrit": 3,
                                    "specialRules": ["Heavy", "Silent"],
                                    "criticalEffects": ["MW3"]
                                }
                            ]
                        },
                        {
                            "type": "((M))",
                            "name": "Fists",
                            "profiles": [
                                {
                                    "attacks": 3,
                                    "skill": 3,
                                    "damageNorm": 2,
                                    "damageCrit": 4
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Sanctus Talon",
                    "mandatory": false,
                    "limitNum": 1,
                    "stats": [6,3,1,3,4,9],
                    "abilities": [
                        {
                            "name": "Cult Ambush"
                        },
                        {
                            "name": "Preternatural Assassin"
                        },
                        {
                            "name": "Creeping Shadow",
                            "description": [
                                "This operative can perform a Charge action while it has a Conceal order. Each time after this operative fights in combat, it can perform a free Dash action, regardless of any other actions it has performed during this activation, and even if it is within Engagement Range of an enemy operative (but it cannot finish that move within Engagement Range of an enemy operative)."
                            ]
                        }
                    ],
                    "actions": [
                        {
                            "name": "Familiar's Soulsight",
                            "cost": 1,
                            "description": [
                                "Select one enemy operative. Until the end of the Turning Point, each time this operative fights in combat with that enemy operative, the Sanctus bio-dagger this operative is equipped with gains the Brutal and Balanced special rules for that combat. Until the end of the Turning Point, each time this operative fights in combat with that enemy operative, in the Resolve Successful Hits step of that combat, the first time you resolve one of your successful critical hits, you can immediately resolve one of your successful normal hits (or a successful critical hit if you have none)."
                            ]
                        }
                    ],
                    "weapons": [
                        {
                            "type": "((M))",
                            "name": "Sanctus bio-dagger",
                            "profiles": [
                                {
                                    "attacks": 4,
                                    "skill": 2,
                                    "damageNorm": 3,
                                    "damageCrit": 6,
                                    "specialRules": ["Lethal 4+"],
                                    "criticalEffects": ["Stun"]
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Locus",
                    "mandatory": false,
                    "limitNum": 1,
                    "stats": [6,3,1,3,4,9],
                    "abilities": [
                        {
                            "name": "Cult Ambush"
                        },
                        {
                            "name": "Preternatural Assassin"
                        },
                        {
                            "name": "Duellist",
                            "description": [
                                "Each time this operative fights in combat, in the Resolve Successful Hits step of that combat, you can resolve one successful hit before the Attacker. If you do so, that successful hit must be used to parry."
                            ]
                        },
                        {
                            "name": "Expert Swordsman",
                            "description": [
                                "This operative can perform two Fight actions during each of its activations. Each time after this operative fights in combat, it can perform a free Charge action (even if it has done so during this activation), but can only move up to ((3))."
                            ]
                        }
                    ],
                    "actions": [
                        {
                            "name": "Quicksilver Strike",
                            "cost": 1,
                            "description": [
                                "Once this Turning Point, when an enemy operative is performing a Normal Move or Dash action and moves within ((3)) of this operative, you can interrupt that action to perform a free Charge action with this operative (it must finish that move within Engagement Range of that enemy operative, and if this operative has a Conceal order, change it to an Engage order to do so). If you do so, that enemy operative’s action ends without finishing their move, and you must then perform a free Fight action with this operative against that enemy operative. This action is treated as a Fight action for the purposes of action restrictions."
                            ]
                        }
                    ],
                    "weapons": [
                        {
                            "type": "((R))",
                            "name": "Barbed tail",
                            "profiles": [
                                {
                                    "attacks": 4,
                                    "skill": 3,
                                    "damageNorm": 3,
                                    "damageCrit": 4,
                                    "range": 3,
                                    "specialRules": ["Silent"]
                                }
                            ]
                        },
                        {
                            "type": "((M))",
                            "name": "Locus blades",
                            "profiles": [
                                {
                                    "attacks": 5,
                                    "skill": 2,
                                    "damageNorm": 4,
                                    "damageCrit": 6,
                                    "specialRules": ["Lethal 5+"]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}